using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Matematico.GameFieldControl
{
    /// <summary>
    /// Клас который описывает карточный банк. В его задачи входит генерация карт ( 52 числа 
    /// которые по величине от 1 до 13 и которые должны повторятся в колоде 4 раза.
    /// </summary>
    class CardBank
    {
        ////-----------------------------------------------Свойства, переменные,ссылки
        /// <summary>
        /// Для генерации случайностей
        /// </summary>
        private Random _random;
        /// <summary>
        /// Список чисел
        /// </summary>
        public List<int> numbers;
        ////---------------------------------------------------------------------------/////

        ////-----------------------------------------------Конструкторы
        public CardBank()
        {
            _random = new Random();
            numbers = new List<int>();
        }
        ////---------------------------------------------------------------------------/////

        ////-----------------------------------------------Приватные методы
        private void Generate()
        {
            //int max = 52;

            //Array[]



        }

        ////---------------------------------------------------------------------------/////
    }
}
